# 1.	Длинна палочек
Есть n палочек с некоторой длиной. Ваша задача - модифицировать палочки так, чтобы каждая палочка имела одинаковую длину.
Вы можете удлинить или укоротить каждую палку. Стоимость обеих операций x, где x - это разница между новой и исходной длиной.
Какова минимальная общая стоимость?
Входные данные
Первая строка ввода содержит целое число n: количество палочек. 
Тогда есть n целых чисел: p1, p2,…, pn: длина палочек.
Выходные данные
Выведите одно целое число: минимальная общая стоимость.
``` ПРИМЕР
Входные данные
5
2 3 1 5 2
Выходные данные
5
```
```Код
import math

minimal = 0
average = 0
count = int(input())
numbers = list(map(int, input().split(" ")))

for i in range(len(numbers)):
    average += numbers[i]
average = math.floor(average/count)

for i in numbers:
    minimal += abs(i-average)
print(minimal)
```


