# 1.	Длинна палочек
Есть n палочек с некоторой длиной. Ваша задача - модифицировать палочки так, чтобы каждая палочка имела одинаковую длину.
Вы можете удлинить или укоротить каждую палку. Стоимость обеих операций x, где x - это разница между новой и исходной длиной.
Какова минимальная общая стоимость?
Входные данные
Первая строка ввода содержит целое число n: количество палочек. 
Тогда есть n целых чисел: p1, p2,…, pn: длина палочек.
Выходные данные
Выведите одно целое число: минимальная общая стоимость.
``` ПРИМЕР
Входные данные
5
2 3 1 5 2
Выходные данные
5
```
```Код
import math

minimal = 0
average = 0
count = int(input())
numbers = list(map(int, input().split(" ")))

for i in range(len(numbers)):
    average += numbers[i]
average = math.floor(average/count)

for i in numbers:
    minimal += abs(i-average)
print(minimal)
```

# 2.	 Нахождение делителей. 
Для n целых чисел, ваша задача состоит в том, чтобы вывести для каждого целого числа количество его делителей.
Например, если x = 18, правильный ответ - 6, потому что его делители 1,2,3,6,9,18.
Входные данные
Первая строка ввода имеет целое число n: количество целых чисел.
После этого идет n строк, каждая из которых содержит целое число x.
Выходные данные
Для каждого целого числа вывести число его делителей.
``` ПРИМЕР
Входные данные
3
16
17
18
Выходные данные
5
2
6
```
```Код
import math

countOfNumber = int(input())
numbers = []
for i in range(countOfNumber):
    numbers.append(int(input()))

for i in numbers:
    countDelimiter = 0
    for n in range(1, int(i / 2) + 1):
        if i % n == 0:
            countDelimiter += 1
    print(countDelimiter + 1)
```

