# 1.	Длинна палочек
Есть n палочек с некоторой длиной. Ваша задача - модифицировать палочки так, чтобы каждая палочка имела одинаковую длину.
Вы можете удлинить или укоротить каждую палку. Стоимость обеих операций x, где x - это разница между новой и исходной длиной.
Какова минимальная общая стоимость?
Входные данные
Первая строка ввода содержит целое число n: количество палочек. 
Тогда есть n целых чисел: p1, p2,…, pn: длина палочек.
Выходные данные
Выведите одно целое число: минимальная общая стоимость.
``` ПРИМЕР
Входные данные
5
2 3 1 5 2
Выходные данные
5
```
```Код
import math
from collections import Counter

minimal = 0
average = 0
count = int(input())
numbers = list(map(int, input().split(" ")))

def summ(arr):
    summOfArray = 0
    for i in arr:
        summOfArray += i
    return summOfArray

average = Counter(numbers).most_common(1)

if(average[0][1] > 1):
    average = average[0][0]
else:
    average = math.floor(summ(numbers)/count)
    
for i in numbers:
    minimal += abs(i-average)
print(minimal)nimal)

```

# 2.	 Нахождение делителей. 
Для n целых чисел, ваша задача состоит в том, чтобы вывести для каждого целого числа количество его делителей.
Например, если x = 18, правильный ответ - 6, потому что его делители 1,2,3,6,9,18.
Входные данные
Первая строка ввода имеет целое число n: количество целых чисел.
После этого идет n строк, каждая из которых содержит целое число x.
Выходные данные
Для каждого целого числа вывести число его делителей.
``` ПРИМЕР
Входные данные
3
16
17
18
Выходные данные
5
2
6
```
```Код
import math

countOfNumber = int(input())
numbers = []
for i in range(countOfNumber):
    numbers.append(int(input()))

for i in numbers:
    countDelimiter = 0
    for n in range(1, int(i / 2) + 1):
        if i % n == 0:
            countDelimiter += 1
    print(countDelimiter + 1)
```

# 3.	Круг студентов
n студентов выстроились в кругу в некотором порядке. Индекс i-го студента равен pi. Гарантируется, что все индексы студентов — различные целые числа от 1 до n (то есть они образуют перестановку).
Студенты хотят станцевать хоровод. Прямой хоровод можно станцевать тогда, когда студент 2 идет сразу же после студента 1 в порядке по часовой стрелке (между ними не должно стоять студентов), студент 3 идет сразу же после студента 2 в порядке по часовой стрелке, и так далее, и студент n идет сразу же за студентом n−1 в порядке по часовой стрелке. Обратный хоровод — почти то же самое. Единственное отличие в том, что студент i должен идти сразу же после студента i−1 в порядке против часовой стрелки (это условие должно выполняться для всех i от 2 до n). 
Например, если индексы студентов в порядке по часовой стрелке равны [2,3,4,5,1], то они могут станцевать прямой хоровод. Если индексы студентов равны [3,2,1,4] в порядке по часовой стрелке, тогда они смогут станцевать обратный хоровод.
Ваша задача — определить, возможно ли станцевать хоровод. Заметьте, что студенты не могут менять своих позиций перед началом танца; они не могут меняться местами или покидать круг, а также никакой другой студент не может встать в круг. 
Вам необходимо ответить на q независимых запросов.
Входные данные
Первая строк входных данных содержит одно целое число q (1≤q≤200) — количество запросов. Затем следуют q запросов.
Первая строка запроса содержит одно целое число n (1≤n≤200) — количество студентов.
Вторая строка запроса содержит перестановку индексов p1,p2,…,pn (1≤pi≤n), где pi равно индексу i-го студента (в порядке по часовой стрелке). Гарантируется, что все pi — различные целые числа от 1 до n (то есть они образуют перестановку).
Выходные данные
Для каждого запроса, выведите ответ на него. Если можно станцевать хоровод с выбранным порядком студентов, выведите «YES». Иначе выведите «NO».
``` ПРИМЕР
Входные данные
5
4
1 2 3 4
3
1 3 2
5
1 2 3 5 4
1
1
5
3 2 1 5 4
Выходные данные
YES
YES
NO
YES
YES
```
``` Код
import math

circles = int(input())
answers = []
for circle in range(circles):
    numbersCount = int(input())
    numbers = list(map(int, input().split(" ")))
    Flag = True
    for num in range(len(numbers)-1):
        if(numbers[num] == 1 and numbers[num+1] == numbersCount):
            continue
        elif(numbers[num] == numbersCount and numbers[num+1] == 1):
            continue
        elif(abs(numbers[num] - numbers[num+1]) == 1):
            continue
        else:
            Flag = False
    answers.append("YES" if Flag else "NO")
for i in answers:
    print(i)
    
```
