# 1.	ПАЛИНДРОМНАЯ ЗАМЕНА
Задана строка s, состоящая из n строчных букв латинского алфавита. n всегда четно.
Для каждой позиции i (1≤i≤n) в строке s вам необходимо заменить букву на этой позиции либо на предыдущую в алфавитном порядке, либо на следующую (для букв 'a' и 'z' доступен только один вариант). Буква на каждой позиции должна быть изменена ровно один раз.
Например, буква 'p' должна быть изменена либо на 'o', либо на 'q', буква 'a' должна быть изменена на 'b', и буква 'z' должна быть изменена на 'y'.
Строка s называется палиндромом, если она читается одинаково как слева направо, так и справа налево. Например, строки «abba» и «zz» — палиндромы, а строки «abca» и «zy» — нет.
Ваша задача — проверить, что можно сделать строку s палиндромом, применив выше приведенные замены к каждой позиции. Выведите «YES», если строку s можно сделать палиндромом. В противном случае выведите «NO».
Каждый тест содержит несколько строк, для каждой из них необходимо решить задачу независимо.
Входные данные
В первой строке записано одно целое число T (1≤T≤50) — количество строк в тесте.
Затем следуют 2T строк — строки (2i−1) и 2i описывают i-ю строку. В первой строке пары записано одно целое число n (2≤n≤100, n четно) — длина соответствующей строки. Во второй строке пары содержится строка s, состоящая из n строчных букв латинского алфавита.
Выходные данные
Выведите T строк. i-я строка должна содержать ответ для i-й строки входных данных. Выведите «YES», если i-ю строку можно сделать палиндромом, применив выше приведенные замены к каждой позиции. В противном случае выведите «NO».
``` Пример
Входные данные
5
6
abccba
2
cf
4
adfa
8
abaazaba
2
ml
Выходные данные
YES
NO
YES
NO
NO
```
``` Код
# Если a и z могут меняться только на b и y соответственно
for i in range(int(input())):
    input()
    text = input()
    Flag = True
    for char in range(len(text)//2):
        res = abs(ord(text[char]) - ord(text[-1 - char]))
        if res != 2 and res != 0:
            Flag = False
    print("YES" if Flag else "NO")
```

# 2. ОТ S К T.
У вас есть три строки s, t и p, состоящие из строчных букв латинского алфавита. Вы можете выполнять любое количество (возможно, нулевое) операций над этими строками.
Каждая операция выглядит следующим образом: вы выбираете любой символ из строки p, удаляете его из p и вставляете в любую позицию строки s (вы можете вставить этот символ куда захотите: в начало s, в конец или между любыми двумя подряд идущими символами).
Например, если p — это aba, и s — это de, тогда возможны следующие варианты (символ, удаленный из p и вставленный в s, выделен жирным шрифтом):
aba → ba, de → ade;
aba → ba, de → dae;
aba → ba, de → dea;
aba → aa, de → bde;
aba → aa, de → dbe;
aba → aa, de → deb;
aba → ab, de → ade;
aba → ab, de → dae;
aba → ab, de → dea;
Вам нужно выполнить несколько (возможно, ноль) операций так, чтобы строка s стала равна строке t. Определите, возможно ли это.
Обратите внимание, что вам нужно ответить на q независимых запросов.

``` Пример
Входные данные
4
ab
acxb
cax
a
aaaa
aaabbcc
a
aaaa
aabbcc
ab
baaa
aaaaa
Выходные данные
YES
YES
NO
NO
```
``` Код
for a in range(int(input())):
    s = list(input())
    t = list(input())
    p = list(input())
    ln = len(t)
    for i in range(len(t)):
        if i < len(s) and t[i] == s[i]:
            continue
        else:
            for j in range(len(p)):
                if t[i] == p[j]:
                   s.insert(i, p[j])
                   p.pop(j)
                   break
    print("YES" if s == t else "NO")
```

# 3. СТРЕЛЬБА.
Вася недавно начал тренироваться стрельбе из пистолета. Сегодня тренер предложил ему следующее задание. Он выставил на стол n банок в ряд. Банки пронумерованы слева направо от 1 до n. Чтобы выполнить задание, Васе предстоит сбить каждую из банок ровно по одному разу. При этом порядок, в котором Вася будет сбивать банки, он выбирает самостоятельно.
Вася знает, что прочность i-й банки равна ai. Это значит, что если Вася уже сбил x банок и сейчас начнет стрелять в i-ю банку, то, чтобы сбить эту банку, ему понадобится (ai*x+1) выстрел. Считайте, что если Вася начал стрелять в банку номер i, то он будет стрелять в нее, пока он ее не собьет.
Определите такой порядок стрельбы по банкам, что Вася сделает минимально возможное количество выстрелов, чтобы сбить каждую из n банок ровно по одному разу.
``` Пример
Пример 1
Входные данные
3
20 10 20
Выходные данные
43
1 3 2
Пример 2
Входные данные
4
10 10 10 10
Выходные данные
64
2 1 4 3
```
``` Код
input()
b = [int(a) for a in input().split()]
n = 0
d = ''
for i in range(len(b)): 
    a = max(b)
    n += a*i + 1
    s = b.index(a)
    d += str(s+1) + ' '
    b[s] = 0
print(n)
print(d)
```

# 4. ЧИСЛА НА ОКРУЖНОСТИ.
Вам дано n чисел a1,a2,…,an. Возможно ли расставить их по окружности таким образом, чтобы каждое число было строго меньше суммы своих соседей?
К примеру, для массива [1,4,5,6,7,8], расстановка слева удовлетворяет условию, в то время как расстановка справа нет, так как 5≥4+1 и 8>1+6.
``` Пример
Пример 1
Входные данные
3
2 4 3
Выходные данные
YES
4 2 3
Пример 2
Входные данные
5
1 2 3 4 4
Выходные данные
YES
4 4 2 1 3

Пример 3
Входные данные
3
13 8 5
Выходные данные
NO
Пример 4
Входные данные
4
1 10 100 1000
Выходные данные
NO
```
``` Код
input()
a = [int(a) for a in input().split()]
ln = len(a)
b = [0 for a in range(ln)]
a.sort()
k = 0 
Flag = True
for i in range(0, ln - 1, 2):
    b[k] = a[i]
    b[-1 - k] = a[i+1]
    k += 1
    
if ln % 2 == 1:
    b[ln//2] = a[-1]

for i in range(ln):
    if b[i - 1] + b[(i + 1) % ln] <= b[i]:
        Flag = False
        
print("YES" if Flag else "NO")
print(*b if Flag else "")
```

# 5. ЦИКЛИЧЕСКИЙ СДВИГ БУКВ.
Вам дана непустая строка s, состоящая из строчных букв английского алфавита. Требуется ровно один раз выбрать в s непустую подстроку и сдвинуть её буквы по циклу: «z»   «y»   «x»   «b»   «a»   «z», то есть заменить каждую букву подстроки на предыдущую в английском алфавите (а букву «a» на букву «z»).
Требуется определить, какую лексикографически минимальную строку можно получить после выполнения ровно одного сдвига?
``` Пример
Входные данные
abacaba
Выходные данные
aaacaba
```
``` Код
a = list(input())
if a.count('a') != len(a):
    fa = 0
    for i in range(len(a)):
        if fa == 2:
            break
        if a[i] =='a':
            fa += 1
            continue
        else:
            a[i] = chr(ord(a[i])-1)
print(''.join(a))
```
