# 1.	ПАЛИНДРОМНАЯ ЗАМЕНА
Задана строка s, состоящая из n строчных букв латинского алфавита. n всегда четно.
Для каждой позиции i (1≤i≤n) в строке s вам необходимо заменить букву на этой позиции либо на предыдущую в алфавитном порядке, либо на следующую (для букв 'a' и 'z' доступен только один вариант). Буква на каждой позиции должна быть изменена ровно один раз.
Например, буква 'p' должна быть изменена либо на 'o', либо на 'q', буква 'a' должна быть изменена на 'b', и буква 'z' должна быть изменена на 'y'.
Строка s называется палиндромом, если она читается одинаково как слева направо, так и справа налево. Например, строки «abba» и «zz» — палиндромы, а строки «abca» и «zy» — нет.
Ваша задача — проверить, что можно сделать строку s палиндромом, применив выше приведенные замены к каждой позиции. Выведите «YES», если строку s можно сделать палиндромом. В противном случае выведите «NO».
Каждый тест содержит несколько строк, для каждой из них необходимо решить задачу независимо.
Входные данные
В первой строке записано одно целое число T (1≤T≤50) — количество строк в тесте.
Затем следуют 2T строк — строки (2i−1) и 2i описывают i-ю строку. В первой строке пары записано одно целое число n (2≤n≤100, n четно) — длина соответствующей строки. Во второй строке пары содержится строка s, состоящая из n строчных букв латинского алфавита.
Выходные данные
Выведите T строк. i-я строка должна содержать ответ для i-й строки входных данных. Выведите «YES», если i-ю строку можно сделать палиндромом, применив выше приведенные замены к каждой позиции. В противном случае выведите «NO».
``` Пример
Входные данные
5
6
abccba
2
cf
4
adfa
8
abaazaba
2
ml
Выходные данные
YES
NO
YES
NO
NO
```
``` Код
a = 'abcdefghijklmnopqrstuvwxyz' # 'a' = chr(97) => -97

for i in range(int(input())):
    input()
    text = input()
    Flag = True
    for char in range(len(text)//2):
        b = text[-1 - char]
        c = text[char]
        dl = len(a)
        if c != b:
            if(a[(ord(c) - 98) % dl] != a[(ord(b) - 96) % dl]
            and a[(ord(c) - 96) % dl] != a[(ord(b) - 98) % dl]
            and a[(ord(c) - 96) % dl] != a[(ord(b) - 96) % dl]):
                Flag =  False
        
    print("YES" if Flag else "NO")
```
